document.addEventListener('DOMContentLoaded', function() {
    // Змінено селектор на 'a', щоб відстежувати кліки по всіх посиланнях на сторінці
    document.querySelectorAll('a').forEach(function(link) {
        link.addEventListener('click', function(e) {
            // Тут можна додати додаткову логіку
            console.log('Перехід за адресою: ' + this.getAttribute('href'));
            // Логіка може включати, наприклад, запуск анімації полоси завантаження,
            // логування для аналітики, перевірку URL на спеціальні умови тощо

            // e.preventDefault(); // Розкоментуйте, якщо потрібно заборонити стандартну поведінку посилання
            // Ви можете додати умову тут, якщо потрібно обробляти лише певні посилання
        });
    });
});